
# homebrew
tap 'homebrew/cask-versions'
tap 'beeftornado/rmtree'
brew 'mas'

# core
cask 'raycast'
cask 'istat-menus'
cask '1password'
cask 'google-chrome'
cask 'signal'
cask 'hazel'
cask 'keyboard-maestro'
cask 'bartender'
cask 'elgato-stream-deck'
cask 'elgato-control-center'
cask 'logitech-camera-settings'
brew 'tailscale'

# tools
brew 'gpg'
brew 'ant'
brew 'jq'
brew 'tree'
brew 'sloccount'
brew 'pinentry-mac'
brew 'p7zip'
brew 'pyenv'
brew 'jless'

# automation
tap 'hashicorp/tap'
brew 'hashicorp/tap/vault'

# productivity
cask 'slack'
cask 'zoom'
cask 'omnifocus'
mas 'Drafts', id: 1435957248
cask 'fantastical'
mas 'MindNode - Mind Map', id: 1289197285
cask 'obsidian'
cask 'devonthink'

# development
cask 'iterm2'
cask 'jetbrains-toolbox'
#brew 'dpkg'
#brew 'rpm'
brew 'pipenv'
cask 'docker'
cask 'google-cloud-sdk'
cask 'insomnia'

# operations
cask 'aviatrix-vpn-client'

# kibana dev
brew 'nvm'
brew 'yarn'

# java versions
brew 'jenv'
brew 'kubectl'
brew 'teleport'

